Autodesk.Revit.DB.IFC.ImporterIFC.SetFile(Autodesk.Revit.DB.IFC.IFCFile)
Sets the handle to the IFC file being created during this import operation.
file:
The handle to the file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ImporterIFC.ProcessIFCProject(Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IDictionary`2{Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.ElementId})
The entry point to the native IFC import function.  Processes the main IfcProject and creates appropriate Revit elements.
Remarks:
This function allows for a "hybrid" .NET/native import.  For any handle below, there will be no native processing,
and it will be assumed that the element created in .NET is valid and appropriate.  Note that this is only applicable
for IFCAnyHandles that are subtypes of IfcProduct and IfcBuildingElementStorey; other handles will be ignored.
Also, note that some elements have interdependencies that are not yet handled by this function.  These include:
1. IfcDoor/IfcWindow and their IfcOpeningElements and 2D representations should both be created in the same environment (.NET or native).
2. Symbols and their instances should both be created in the same environment (.NET or native).
ifcProject:
The IfcProject containing the entities in the IFC file.
createdElements:
The element ids for the already created elements.  These handles will not be processed in native code.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.ImporterIFC.ProcessIFCProject(Autodesk.Revit.DB.IFC.IFCAnyHandle)
The entry point to the native IFC import function.  Processes the main IfcProject and creates appropriate Revit elements.
ifcProject:
The IfcProject containing the entities in the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ImporterIFC.GetOptions
Gets the collection of named options set by the importer client.
Returns:
The collection of named options.
Since:
2015

Autodesk.Revit.DB.IFC.ImporterIFC.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.ImporterIFC.Document
Gets the document associated with the import.
Since:
2015

Autodesk.Revit.DB.IFC.ImporterIFC.FullFileName
The full file name of the IFC file to be import.
Since:
2014

Autodesk.Revit.DB.IFC.ImporterIFC
The main class provided by Revit to allow implementation of IFC import.
Remarks:
An instance of this class is provided to clients which implement IImporterIFC
in order to provide an implementation for IFC import.  It contains information
on the options selected by the user for the import operation, as well as
members used to access specific types of data needed to implement the import
properly.
Since:
2014